[
  {
    "id": "transporter",
    "name": "Transporter",
    "description": "Enables the beaming of crew members. Can't pass through enemy shields. Transporters can only beam between transport platforms. The receiving end is usually equipped with filters that disable all uncommon hazards. This includes contamination or large explosives.",
    "energy": 5,
    "costs": 4
  },
  {
    "id": "arc-field",
    "name": "Arc field",
    "description": "50% chance to destroy enemy rockets shortly before impact. Not compatible with other defensive force fields",
    "energy": 14,
    "costs": 6
  },
  {
    "id": "reflector-field",
    "name": "reflector field",
    "description": "A quarter of incoming beam damage is reflected to the attacker. Not compatible with other defensive force fields.",
    "energy": 20,
    "costs": 25
  },
  {
    "id": "dampening-field",
    "name": "Dampening field",
    "description": "Half of incoming beam damage is absorbed. Not compatible with shields and other defensive force fields.",
    "energy": 30,
    "costs": 30
  },
  {
    "id": "projectile-deflector",
    "name": "Projectile deflector",
    "description": "Half of incoming ballistic damage is absorbed. Not compatible with other defensive force fields.",
    "energy": 20,
    "costs": 15
  },
  {
    "id": "hyper-x-capacitors",
    "name": "Hyper-X Capacitors",
    "description": "Allows to fire beam weapons twice in one action but also doubling the required amount of ticks.",
    "energy": 5,
    "costs": 8
  },
  {
    "id": "hanger",
    "name": "Hanger",
    "description": "A small hanger tha can contain a fighter or a shuttle.",
    "max": {"expression": "(size-2)*(size-2)"},
    "energy": 2,
    "costs": 5
  },
  {
    "id": "quarters",
    "name": "Quarters",
    "description": "Adds four quarters tha have space for two people each. It is more comfortable to use a quarter only for one person. The energy demand is to upgrade life support accordingly.",
    "max": {"expression": "size*size-1"},
    "energy": 1,
    "costs": 1
  },
  {
    "id": "cargo",
    "name": "Cargo hold",
    "description": "Some space to transport goods. Each cargo hold can hold 24 m³ of volume.",
    "max": {"expression": "size*size-1"},
    "energy": 0,
    "costs": 1
  },
  {
    "id": "drone-control",
    "name": "Drone control",
    "description": "Allows to store and operate drones. Provides 10 drone slots. Most drones require multiple slots.",
    "max": {"expression": "(size-1)*(size-1)"},
    "energy": 5,
    "costs": 5
  },
  {
    "id": "concealment-system",
    "name": "Concealment system",
    "description": "Reduces the ships emission and makes it hard to detect for enemy sensors. As long as remaining silent it is hard to detect but once spotted it can be normally tracked. The ship can only actively be detected with a check that suffers a penalty of 5.",
    "energy": {"expression": "size+1"},
    "costs": {"expression": "size+5"}
  },
  {
    "id": "cloaking",
    "name": "Cloaking",
    "description": "Reduces emissions and surrounds the ship with a force field that makes it invisible to the eye. The ship can only be detected through an active check with a penalty of 10. Ths ship is still physically present and can be affected by attacks or hazards. 15 ticks without any incoming damage are required for the cloaking field to regenerate. Damage and firing weapons let the field collapse.",
    "energy": {"expression": "size*3+2"},
    "costs": {"expression": "size*3+5"}
  },
  {
    "id": "phase-cloak",
    "name": "Phase cloak",
    "description": "Shifts the whole vessel into another phase. It can only actively be detected with a penalty of 15 but can't attack or be attacked. It needs 5 ticks to return to normal phase and 20 to shift to another phase. Incoming damage interrupts the cloaking process.",
    "energy": {"expression": "size*size+6"},
    "costs": {"expression": "size*5+10"}
  },
  {
    "id": "jump-drive",
    "name": "Jump drive",
    "description": "Allows to travel faster than light. Requires 40 ticks to load the capacitors.",
    "energy": {"expression": "size*2+2"},
    "costs": {"expression": "size+4"}
  },
  {
    "id": "bussard-ramjet",
    "name": "Bussard ramjet",
    "description": "Installation to collect deuterium in space using force fields. Can be used to gain fuel from a gas giant.",
    "energy": 2,
    "costs": 6
  },
  {
    "id": "tractor-beam",
    "name": "Tractor beam",
    "description": "A beam of energy that can be used to move objects such as space ships or hold them stationary. Every beam can only target a single object and it takes 8 ticks to establish and 3 ticks to release the beam. The target may not exceed the vessels size. The pilot of a ship can try to break free by spending 15 ticks and making a check with difficulty 25 plus plus twice the difference in size of the ships.",
    "max": {"expression": "size"},
    "energy": {"expression": "size+4"},
    "costs": 5
  }
]
